DiffusiveMixing/H-mixer/45deg/cL2/U0.1/flowField/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 	2.0;
	format      ascii;
    class       volVectorField;
	location 	"0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    walls
    {
        type            noSlip;
    }

    outlet_0
    {
        type            zeroGradient;
    }

    outlet_1
    {
        type            zeroGradient;
    }

    inlet_0
    {
        type            uniformFixedValue;
        uniformValue    (0.07071068 0.07071068 0);
    }

    inlet_1
    {
        type            uniformFixedValue;
        uniformValue    (0.07071068 -0.07071068 0);
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
